app/Config/Database.php

SELECT *
FROM "company_database_config"
WHERE "company_name" = 'company1'
---
    private function getDatabaseDetailsFromMaster(string $subdomain): ?array
    {
        // log_message('debug', 'Fetched Company Config: ' . print_r($subdomain, true));
        $db = \Config\Database::connect($this->default);
        $builder = $db->table('company_database_config');

        $companyConfig = $builder->where('company_name', $subdomain)->get()->getRowArray();