app/Models/Auth/UserModel.php

    public function getUserByEmail($email)
    {
        // echo "Fetching user by email from the database: ".$email;
        // print_r($this->db->table($this->table)->where('email', $email)->get()->getRow());
        return $this->db->table($this->table)->where('email', $email)->get()->getRow();
---
SELECT *
FROM "users"
WHERE "email" = 'preetam@yopmail.com'