app/Models/framework/StakeholderMenuMapModel.php

SELECT *
FROM "framework"."stakeholder_menu_map"
WHERE "institute_id" = 1
AND "stakeholder_type" = 'E'
AND "stakeholder_id" = '1'
---
    public function getStakeholderMenuMapById($institute_id, $stakeholder_type, $stakeholder_id)
    {
        $return =  $this->db->table($this->table)
            ->where('institute_id', $institute_id)
            ->where('stakeholder_type', $stakeholder_type)
            ->where('stakeholder_id', $stakeholder_id)
            ->get()
            ->getResultArray();